#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Сведения о внешней обработке.
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция СведенияОВнешнейОбработке() Экспорт
	
	Перем мДополнительныеОтчетыИОбработки, мДополнительныеОтчетыИОбработкиКлиентСервер;
	
	Если Метаданные.ОбщиеМодули.Найти("ДополнительныеОтчетыИОбработки") = Неопределено
		ИЛИ Метаданные.ОбщиеМодули.Найти("ДополнительныеОтчетыИОбработкиКлиентСервер") = Неопределено Тогда
		ВызватьИсключение "Не обнаружены общие модули БСП!";
	КонецЕсли;
	
	//@skip-check server-execution-safe-mode
	мДополнительныеОтчетыИОбработки = Вычислить("ДополнительныеОтчетыИОбработки");
	//@skip-check server-execution-safe-mode
	мДополнительныеОтчетыИОбработкиКлиентСервер = Вычислить("ДополнительныеОтчетыИОбработкиКлиентСервер");
	
    ПараметрыРегистрации                    = мДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    ПараметрыРегистрации.Вид                = мДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.Версия             = "1.1.2";
    ПараметрыРегистрации.БезопасныйРежим    = Ложь;
    
    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление        = Метаданные().Представление();
    Команда.Идентификатор        = Метаданные().Имя;
    Команда.Использование        = мДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    Команда.ПоказыватьОповещение = Ложь;
    
    Возврат ПараметрыРегистрации; 
    
КонецФункции

#КонецОбласти

#КонецЕсли