#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сведения о внешней обработке
// 
// Возвращаемое значение:
//  см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке 
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	МодульБСП = ОбщийМодуль("ДополнительныеОтчетыИОбработки");
	МодульБСПКлиентСервер = ОбщийМодуль("ДополнительныеОтчетыИОбработкиКлиентСервер");
	
	Если МодульБСПКлиентСервер = Неопределено
		ИЛИ МодульБСП = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	ПараметрыРегистрации                    = МодульБСП.СведенияОВнешнейОбработке();
    ПараметрыРегистрации.Вид                = МодульБСПКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.Версия             = НомерВерсииИнструмента();
    ПараметрыРегистрации.БезопасныйРежим    = Ложь;
    
    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление        = Метаданные().Представление();
    Команда.Идентификатор        = Метаданные().Имя;
    Команда.Использование        = МодульБСПКлиентСервер.ТипКомандыОткрытиеФормы();
    Команда.ПоказыватьОповещение = Ложь;
    
    Возврат ПараметрыРегистрации; 
    
КонецФункции

// Номер версии инструмента.
// 
// Возвращаемое значение:
//  Строка - Номер версии инструмента
Функция НомерВерсииИнструмента() Экспорт
    
    Возврат "0.1.2";
    
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбщийМодуль(ИмяОбщегоМодуля)
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяОбщегоМодуля) Тогда
		Возврат Вычислить(ИмяОбщегоМодуля);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции


#КонецОбласти

#КонецЕсли